tutorials/multiphaseTransport/interTransferFoam/risingBubble2D/system/controlDictInit
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interTransferFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.04;

deltaT          1e-6;

writeControl    adjustable;

writeInterval   0.02; 

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo 0.2;

maxAlphaCo      0.2;

maxDeltaT       4e-5; 

// ************************************************************************* //
