tutorials/multiphaseTransport/interTransferFoam/risingBubble2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices        
(
    (0 0 0) //0
    (0.012 0 0) //1
    (0.012 0.024 0) //2
    (0 0.024 0) //3
    (0 0 1e-6) //4
    (0.012 0 1e-6) //5 
    (0.012 0.024 1e-6) //6
    (0 0.024 1e-6) //7
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (120 240 1) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    walls
    {
        type patch;
        faces
        (
            (3 7 6 2)
	    (1 2 5 6)
            (0 1 5 4)
        );
    }
    left 
    {
		type symmetryPlane;
		faces
		(
	    	(0 4 7 3)
		);
    } 

    frontAndBack
    {
               type empty;
               faces
               (
               (0 3 2 1)
               (4 5 6 7)
               );
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
